post/Games/mc/Minecraft_mods_list.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<meta name="author" content="不要在意我的头像QwQ" />
<meta name="generator" content="Org Mode (third party program by python)" />
<title>Minecraft模组列表</title>
<link rel="stylesheet" type="text/css" href="/theme/main.css"/>
<link rel="shortcut icon" href="/img/icon.jpg"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="#"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div>
<div id="content" class="content">
<h1 class="title">Minecraft模组列表</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul><li><a href="#org-title-1">1. 前言</a></li><li><a href="#org-title-2">2. 列表</a></li><li><a href="#org-title-3">3. 资源包列表</a></li></ul></div></div>
<div id="outline-container-1" class="outline-2">
<h2 id="org-title-1"><span class="section-number-2">1.</span> 前言</h2>
<div class="outline-text-2" id="text-1"><p>这里的mc模组多是辅助类型，使用 <code>fabric</code> 作加载器，适合生电玩家，会附上下载链接</p><p>建议使用1.18.2版本和1.20.1版本，这两个版本受支持的模组数量较多</p></div></div>
<div id="outline-container-2" class="outline-2">
<h2 id="org-title-2"><span class="section-number-2">2.</span> 列表</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">名称(部分使用功能作代称，括号内为原名)</th><th scope="col" class="org-left">功能介绍</th><th scope="col" class="org-left">相关链接</th></tr>
</thead><tbody>
<tr><td class="org-left">游戏性能优化：</td><td class="org-left">&nbsp;</td><td class="org-left">&nbsp;</td></tr><tr><td class="org-left">快速启动(lazydfu)</td><td class="org-left">将加载行为延后加快启动速度</td><td class="org-left"><a href="https://www.mcmod.cn/class/3407.html">mc百科</a>;
<a href="https://modrinth.com/mod/lazydfu/versions">modrinth</a></td></tr><tr><td class="org-left">平滑启动(smoothboot)</td><td class="org-left">1.19.4后游戏自带</td><td class="org-left"><a href="https://www.mcmod.cn/class/3422.html">mc百科</a>;
<a href="https://modrinth.com/mod/smoothboot-fabric/versions">modrinth</a></td></tr>
</tbody><tbody>
<tr><td class="org-left">画面显示优化：</td><td class="org-left">&nbsp;</td><td class="org-left">&nbsp;</td></tr><tr><td class="org-left">变焦(WI-Zoom)</td><td class="org-left">缩放视角，类似于OptFine</td><td class="org-left"><a href="https://www.mcmod.cn/class/5134.html">mc百科</a>;
<a href="https://modrinth.com/mod/wi-zoom/versions">modrinth</a></td></tr><tr><td class="org-left">床渲染优化(betterbeds)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/4356.html">mc百科</a>;
<a href="https://modrinth.com/mod/better-beds/versions">modrinth</a></td></tr><tr><td class="org-left">动态光源(lambdynamiclights)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/2954.html">mc百科</a>;
<a href="https://modrinth.com/mod/lambdynamiclights/versions">modrinth</a></td></tr><tr><td class="org-left">光影渲染(iris)</td><td class="org-left">光影渲染</td><td class="org-left"><a href="https://www.mcmod.cn/class/3697.html">mc百科</a>;
<a href="https://modrinth.com/mod/iris/versions">modrinth</a></td></tr><tr><td class="org-left">钠(sodium)</td><td class="org-left">光影渲染依赖;类OptFine渲染优化</td><td class="org-left"><a href="https://www.mcmod.cn/class/2785.html">mc百科</a>;
<a href="https://modrinth.com/mod/sodium/versions">modrinth</a></td></tr><tr><td class="org-left">光照优化(starlight)</td><td class="org-left">1.20新的游戏光照引擎自带优化</td><td class="org-left"><a href="https://www.mcmod.cn/class/3303.html">mc百科</a>;
<a href="https://modrinth.com/mod/starlight/versions">modrinth</a></td></tr>
</tbody><tbody>
<tr><td class="org-left">生电工具：</td><td class="org-left">&nbsp;</td><td class="org-left">&nbsp;</td></tr><tr><td class="org-left">模组菜单(modmenu)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/1675.html">mc百科</a>;
<a href="https://modrinth.com/mod/modmenu/versions">modrinth</a></td></tr><tr><td class="org-left">LIB(malilib)</td><td class="org-left">投影，minihud,tweakeroo前置</td><td class="org-left"><a href="https://www.mcmod.cn/class/2298.html">mc百科</a>;
<a href="https://modrinth.com/mod/malilib/versions">modrinth</a>;
<a href="https://masa.dy.fi/tmp/minecraft/mods/client_mods/?mcver=All&amp;mod=malilib">masa官方</a></td></tr><tr><td class="org-left">工具集(tweakeroo)</td><td class="org-left">灵魂出窍</td><td class="org-left"><a href="https://www.mcmod.cn/class/2230.html">mc百科</a>;
<a href="https://modrinth.com/mod/tweakeroo/versions">modrinth</a>;
<a href="https://masa.dy.fi/tmp/minecraft/mods/client_mods/?mcver=All&amp;mod=tweakeroo">masa官方</a></td></tr><tr><td class="org-left">迷你HUD(minihud)</td><td class="org-left">信息显示，光照等级，结构，长度</td><td class="org-left"><a href="https://www.mcmod.cn/class/2311.html">mc百科</a>;
<a href="https://modrinth.com/mod/minihud/versions">modrinth</a>;
<a href="https://masa.dy.fi/tmp/minecraft/mods/client_mods/?mcver=All&amp;mod=minihud">masa官方</a></td></tr><tr><td class="org-left">投影(litematica)</td><td class="org-left">抄、分享工程利器</td><td class="org-left"><a href="https://www.mcmod.cn/class/2261.html">mc百科</a>;
<a href="https://modrinth.com/mod/litematica/versions">modrinth</a>;
<a href="https://masa.dy.fi/tmp/minecraft/mods/client_mods/?mcver=All&amp;mod=litematica">masa官方</a></td></tr><tr><td class="org-left">地毯(fabric-carpet)</td><td class="org-left">假人、机器产量计数、村民信息</td><td class="org-left"><a href="https://www.mcmod.cn/class/2361.html">mc百科</a>;
<a href="https://modrinth.com/mod/carpet/versions">modrinth</a></td></tr><tr><td class="org-left">地毯GCA(gugle-carpet-addition)</td><td class="org-left">支持假人操作(真 假人科技)</td><td class="org-left"><a href="https://www.mcmod.cn/class/7305.html">mc百科</a>;
<a href="https://modrinth.com/mod/gca">modrinth</a></td></tr><tr><td class="org-left">小地图(Xaeros_Minimap)</td><td class="org-left">更新很频繁的小地图</td><td class="org-left"><a href="https://www.mcmod.cn/class/1701.html">mc百科</a>;
<a href="https://modrinth.com/mod/xaeros-minimap/versions">modrinth</a>;
<a href="https://chocolateminecraft.com/minimapdownload.php">官方</a></td></tr><tr><td class="org-left">世界地图(XaerosWorldMap)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/1701.html">mc百科</a>;
<a href="https://modrinth.com/mod/xaeros-world-map/versions">modrinth</a>;
<a href="https://chocolateminecraft.com/worldmapdownload.php">官方</a></td></tr><tr><td class="org-left">饱食度显示(appleskin)</td><td class="org-left">显示更详细的饱食度信息</td><td class="org-left"><a href="https://www.mcmod.cn/class/744.html">mc百科</a>;
<a href="https://modrinth.com/mod/appleskin/versions">modrinth</a></td></tr><tr><td class="org-left">LIB(badpackets)</td><td class="org-left">wthit前置</td><td class="org-left"><a href="https://www.mcmod.cn/class/6275.html">mc百科</a>;
<a href="https://modrinth.com/mod/badpackets/versions">modrinth</a></td></tr><tr><td class="org-left">头顶物体显示(wthit)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/3471.html">mc百科</a>;
<a href="https://modrinth.com/mod/wthit/versions">modrinth</a></td></tr><tr><td class="org-left">LIB(architectury)</td><td class="org-left">REI前置</td><td class="org-left"><a href="https://www.mcmod.cn/class/3434.html">mc百科</a>;
<a href="https://modrinth.com/mod/architectury-api/versions">modrinth</a></td></tr><tr><td class="org-left">物品管理REI(RoughlyEnoughItems)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/1674.html">mc百科</a>;
<a href="https://modrinth.com/mod/rei/versions">modrinth</a></td></tr><tr><td class="org-left">LIB(fabric-language-kotlin)</td><td class="org-left">IPN前置</td><td class="org-left"><a href="https://www.mcmod.cn/class/2126.html">mc百科</a>;
<a href="https://modrinth.com/mod/fabric-language-kotlin/versions">modrinth</a></td></tr><tr><td class="org-left">LIB(libIPN)</td><td class="org-left">IPN前置</td><td class="org-left"><a href="https://www.mcmod.cn/class/7713.html">mc百科</a>;
<a href="https://modrinth.com/mod/libipn/versions">modrinth</a></td></tr><tr><td class="org-left">一键背包整理IPN(InventoryProfilesNext)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/4104.html">mc百科</a>;
<a href="https://modrinth.com/mod/inventory-profiles-next/versions">modrinth</a></td></tr><tr><td class="org-left">自定义局域网联机(lanserverproperties)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/2754.html">mc百科</a>;
<a href="https://modrinth.com/mod/lan-server-properties/versions">modrinth</a></td></tr><tr><td class="org-left">自动钓鱼(Autofish)</td><td class="org-left">只有1.19.3及以下版本</td><td class="org-left"><a href="https://www.mcmod.cn/class/262.html">mc百科</a>;
<a href="https://www.curseforge.com/minecraft/mc-mods/autofish">curseforge</a></td></tr>
</tbody><tbody>
<tr><td class="org-left">体验优化类(不一定有用)：</td><td class="org-left">&nbsp;</td><td class="org-left">&nbsp;</td></tr><tr><td class="org-left">更好的F3(BetterF3)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/3525.html">mc百科</a>;
<a href="https://modrinth.com/mod/betterf3/versions">modrinth</a></td></tr><tr><td class="org-left">高亮实体(entity-outliner)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/7339.html">mc百科</a>;
<a href="https://www.curseforge.com/minecraft/mc-mods/entity-outliner">curseforge</a></td></tr><tr><td class="org-left">脚步声(PresenceFootsteps)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/4753.html">mc百科</a>;
<a href="https://modrinth.com/mod/presence-footsteps/versions">modrinth</a></td></tr><tr><td class="org-left">动态声音滤波器(DynamicSoundFilters)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/3541.html">mc百科</a>;
<a href="https://modrinth.com/mod/dynamic-sound-filters/versions">modrinth</a></td></tr>
</tbody><tbody>
<tr><td class="org-left">其他模组(部分可能破坏游戏玩法)：</td><td class="org-left">&nbsp;</td><td class="org-left">&nbsp;</td></tr><tr><td class="org-left">连锁挖矿(diggusmaximus)</td><td class="org-left">仅支持到1.20.1</td><td class="org-left"><a href="https://www.mcmod.cn/class/3080.html">mc百科</a>;
<a href="https://modrinth.com/mod/diggus-maximus/versions">modrinth</a></td></tr><tr><td class="org-left">墓碑(youre-in-grave-danger)</td><td class="org-left">&nbsp;</td><td class="org-left"><a href="https://www.mcmod.cn/class/7864.html">mc百科</a>;
<a href="https://modrinth.com/mod/yigd/versions">modrinth</a></td></tr><tr><td class="org-left">回放mod(replaymod)</td><td class="org-left">up主爱用</td><td class="org-left"><a href="https://www.mcmod.cn/class/1203.html">mc百科</a>;
<a href="https://modrinth.com/mod/replaymod/versions">modrinth</a></td></tr><tr><td class="org-left">鞘翅滚转(do-a-barrel-roll)</td><td class="org-left">除非趣味，不建议使用，晕</td><td class="org-left"><a href="https://www.mcmod.cn/class/7724.html">mc百科</a>;
<a href="https://modrinth.com/mod/do-a-barrel-roll/versions">modrinth</a></td></tr><tr><td class="org-left">鞘翅HUD(flighthud)</td><td class="org-left">仅支持到1.19</td><td class="org-left"><a href="https://www.mcmod.cn/class/7547.html">mc百科</a>;
<a href="https://www.curseforge.com/minecraft/mc-mods/flighthud">curseforge</a></td></tr><tr><td class="org-left">LIB(cloth-config)</td><td class="org-left">一大堆模组的依赖</td><td class="org-left"><a href="https://www.mcmod.cn/class/2346.html">mc百科</a>;
<a href="https://modrinth.com/mod/cloth-config/versions">modrinth</a></td></tr></table></div></div>
<div id="outline-container-3" class="outline-2">
<h2 id="org-title-3"><span class="section-number-2">3.</span> 资源包列表</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"><colgroup><col class="org-left" />
<col class="org-left" /></colgroup><thead><tr><th scope="col" class="org-left">名称/功能描述</th><th scope="col" class="org-left">链接</th></tr>
</thead><tbody>
<tr><td class="org-left">masa模组ui界面汉化</td><td class="org-left"><a href="https://modrinth.com/resourcepack/masa-mod-translationpack">modrinth</a></td></tr><tr><td class="org-left">xaeros小地图和世界地图汉化</td><td class="org-left"><a href="https://modrinth.com/resourcepack/xaero-map-chinese">modrinth</a></td></tr></table></div></div></div>
<div id="postamble" class="status"><p class="date">时间: <2025-09-26 五 10:40></p>
<p class="author">作者: 不要在意我的头像QwQ</p>
<p class="date">生成于: 2025-10-01 四 01:35:03</p>
</div>
</body>
</html>